Repository: abdulmajeedx/InspireDownloader
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

source: You must sign in to access this page.
ar: يجب تسجيل الدخول للوصول إلى هذه الصفحة.

source: Please paste a TikTok link before downloading.
ar: الرجاء لصق رابط تيك توك قبل التحميل.

source: Only TikTok video URLs are supported at the moment.
ar: في الوقت الحالي، روابط فيديوهات تيك توك فقط مدعومة.

source: Unable to download this TikTok link. Please verify the URL.
ar: لم نتمكن من تحميل هذا الرابط. الرجاء التحقق من الرابط.

source: Unexpected error while downloading. Try again shortly.
ar: حدث خطأ غير متوقع أثناء التحميل. حاول مرة أخرى قريبًا.

source: Account temporarily locked. Try again in %(seconds)s seconds.
ar: الحساب مقفل مؤقتًا. حاول مرة أخرى خلال %(seconds)s ثانية.

source: Too many failed attempts. Login locked for 10 minutes.
ar: محاولات فاشلة كثيرة. تم قفل الدخول لمدة 10 دقائق.

source: Invalid credentials. %(count)s attempt(s) remaining before lockout.
ar: بيانات الدخول غير صحيحة. %(count)s محاولة(ات) متبقية قبل القفل.

source: Signed out successfully.
ar: تم تسجيل الخروج بنجاح.

source: %(label)s must be a valid HEX code (e.g., #112233).
ar: %(label)s يجب أن يكون رمز HEX صالح (مثال: #112233).

source: Application name cannot be empty.
ar: لا يمكن أن يكون اسم التطبيق فارغًا.

source: Content updated successfully.
ar: تم تحديث المحتوى بنجاح.

source: Advanced TikTok Video Downloader
ar: محمّل فيديوهات تيك توك المتقدم

source: Save TikTok videos in high quality with smart link recognition, metadata enrichment, and rapid delivery.
ar: احفظ فيديوهات تيك توك بجودة عالية مع التعرف الذكي على الروابط وإثراء البيانات الوصفية والتسليم السريع.

source: Paste your TikTok link here...
ar: ألصق رابط تيك توك هنا...

source: Download Now
ar: حمّل الآن

source: No login required. No watermark. Full HD in seconds.
ar: لا يتطلب تسجيل دخول. لا يوجد علامة مائية. جودة كاملة HD في ثوانٍ.

source: Why creators love %(app)s
ar: لماذا يحب المبدعون %(app)s

source: AI-powered link analysis to auto-detect best media quality
ar: تحليل الروابط بالذكاء الاصطناعي لاكتشاف أفضل جودة للوسائط تلقائيًا

source: Batch downloads with smart queueing and progress tracking
ar: تحميلات مجمعة مع الطابور الذكي وتتبع التقدم

source: Built-in privacy shield to strip watermarks & tracking codes
ar: درع خصوصية مدمج لإزالة العلامات المائية وأكواد التتبع

source: Best Quality
ar: أفضل جودة

source: views
ar: مشاهدة

source: likes
ar: إعجاب

source: Video downloaded successfully!
ar: تم تحميل الفيديو بنجاح!

source: Built for visionaries. Powered by %(app)s.
ar: Powered by %(app)s.
